# ####################################################################

#  Created by Encounter(R) RTL Compiler RC14.22 - v14.20-s016_1 on Thu Dec 17 13:04:58 -0200 2015

# ####################################################################

set sdc_version 1.7

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design top

create_clock -name "clk" -add -period 50 -waveform {0.0 25} [get_ports CLK]
set_clock_transition 1.0 [get_clocks clk]
create_clock -name "tclk" -add -period 50 -waveform {0.0 25} [get_ports TCLK]
set_load -pin_load 0.005 [get_ports MISO]
set_load -pin_load 0.005 [get_ports {PORT_OUT[7]}]
set_load -pin_load 0.005 [get_ports {PORT_OUT[6]}]
set_load -pin_load 0.005 [get_ports {PORT_OUT[5]}]
set_load -pin_load 0.005 [get_ports {PORT_OUT[4]}]
set_load -pin_load 0.005 [get_ports {PORT_OUT[3]}]
set_load -pin_load 0.005 [get_ports {PORT_OUT[2]}]
set_load -pin_load 0.005 [get_ports {PORT_OUT[1]}]
set_load -pin_load 0.005 [get_ports {PORT_OUT[0]}]
set_load -pin_load 0.005 [get_ports PC_OF]
set_load -pin_load 0.005 [get_ports PC_UF]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks tclk] -add_delay 2.0 [get_ports CLK]
set_input_delay -clock [get_clocks tclk] -add_delay 2.0 [get_ports RST]
set_input_delay -clock [get_clocks tclk] -add_delay 2.0 [get_ports HOLDn]
set_input_delay -clock [get_clocks tclk] -add_delay 2.0 [get_ports TEN]
set_input_delay -clock [get_clocks tclk] -add_delay 2.0 [get_ports TCLK]
set_input_delay -clock [get_clocks tclk] -add_delay 2.0 [get_ports PROG]
set_input_delay -clock [get_clocks tclk] -add_delay 2.0 [get_ports MOSI]
set_input_delay -clock [get_clocks tclk] -add_delay 2.0 [get_ports BRSTn]
set_input_delay -clock [get_clocks tclk] -add_delay 2.0 [get_ports {PORT_IN[7]}]
set_input_delay -clock [get_clocks tclk] -add_delay 2.0 [get_ports {PORT_IN[6]}]
set_input_delay -clock [get_clocks tclk] -add_delay 2.0 [get_ports {PORT_IN[5]}]
set_input_delay -clock [get_clocks tclk] -add_delay 2.0 [get_ports {PORT_IN[4]}]
set_input_delay -clock [get_clocks tclk] -add_delay 2.0 [get_ports {PORT_IN[3]}]
set_input_delay -clock [get_clocks tclk] -add_delay 2.0 [get_ports {PORT_IN[2]}]
set_input_delay -clock [get_clocks tclk] -add_delay 2.0 [get_ports {PORT_IN[1]}]
set_input_delay -clock [get_clocks tclk] -add_delay 2.0 [get_ports {PORT_IN[0]}]
set_output_delay -clock [get_clocks tclk] -add_delay -min 3.0 [get_ports MISO]
set_output_delay -clock [get_clocks tclk] -add_delay -min 3.0 [get_ports {PORT_OUT[7]}]
set_output_delay -clock [get_clocks tclk] -add_delay -min 3.0 [get_ports {PORT_OUT[6]}]
set_output_delay -clock [get_clocks tclk] -add_delay -min 3.0 [get_ports {PORT_OUT[5]}]
set_output_delay -clock [get_clocks tclk] -add_delay -min 3.0 [get_ports {PORT_OUT[4]}]
set_output_delay -clock [get_clocks tclk] -add_delay -min 3.0 [get_ports {PORT_OUT[3]}]
set_output_delay -clock [get_clocks tclk] -add_delay -min 3.0 [get_ports {PORT_OUT[2]}]
set_output_delay -clock [get_clocks tclk] -add_delay -min 3.0 [get_ports {PORT_OUT[1]}]
set_output_delay -clock [get_clocks tclk] -add_delay -min 3.0 [get_ports {PORT_OUT[0]}]
set_output_delay -clock [get_clocks tclk] -add_delay -min 3.0 [get_ports PC_OF]
set_output_delay -clock [get_clocks tclk] -add_delay -min 3.0 [get_ports PC_UF]
set_output_delay -clock [get_clocks tclk] -add_delay -max 5.0 [get_ports MISO]
set_output_delay -clock [get_clocks tclk] -add_delay -max 5.0 [get_ports {PORT_OUT[7]}]
set_output_delay -clock [get_clocks tclk] -add_delay -max 5.0 [get_ports {PORT_OUT[6]}]
set_output_delay -clock [get_clocks tclk] -add_delay -max 5.0 [get_ports {PORT_OUT[5]}]
set_output_delay -clock [get_clocks tclk] -add_delay -max 5.0 [get_ports {PORT_OUT[4]}]
set_output_delay -clock [get_clocks tclk] -add_delay -max 5.0 [get_ports {PORT_OUT[3]}]
set_output_delay -clock [get_clocks tclk] -add_delay -max 5.0 [get_ports {PORT_OUT[2]}]
set_output_delay -clock [get_clocks tclk] -add_delay -max 5.0 [get_ports {PORT_OUT[1]}]
set_output_delay -clock [get_clocks tclk] -add_delay -max 5.0 [get_ports {PORT_OUT[0]}]
set_output_delay -clock [get_clocks tclk] -add_delay -max 5.0 [get_ports PC_OF]
set_output_delay -clock [get_clocks tclk] -add_delay -max 5.0 [get_ports PC_UF]
set_input_transition 1.736 [get_ports CLK]
set_input_transition 1.736 [get_ports RST]
set_input_transition 1.736 [get_ports HOLDn]
set_input_transition 1.736 [get_ports TEN]
set_input_transition 1.736 [get_ports TCLK]
set_input_transition 1.736 [get_ports PROG]
set_input_transition 1.736 [get_ports MOSI]
set_input_transition 1.736 [get_ports BRSTn]
set_input_transition 1.736 [get_ports {PORT_IN[7]}]
set_input_transition 1.736 [get_ports {PORT_IN[6]}]
set_input_transition 1.736 [get_ports {PORT_IN[5]}]
set_input_transition 1.736 [get_ports {PORT_IN[4]}]
set_input_transition 1.736 [get_ports {PORT_IN[3]}]
set_input_transition 1.736 [get_ports {PORT_IN[2]}]
set_input_transition 1.736 [get_ports {PORT_IN[1]}]
set_input_transition 1.736 [get_ports {PORT_IN[0]}]
set_wire_load_selection_group "3_metls_routing" -library "CTC06ST_typ_3_3V_25C"
#set_dont_use [get_lib_cells CTC06ST_typ_3_3V_25C/SDFFRQST_X1]
#set_dont_use [get_lib_cells CTC06ST_typ_3_3V_25C/SDFFRQST_X2]
#set_dont_use [get_lib_cells CTC06ST_typ_3_3V_25C/SDFFRQST_X4]
#set_dont_use [get_lib_cells CTC06ST_typ_3_3V_25C/SDFFSQST_X1]
#set_dont_use [get_lib_cells CTC06ST_typ_3_3V_25C/SDFFSQST_X2]
#set_dont_use [get_lib_cells CTC06ST_typ_3_3V_25C/SDFFSQST_X4]
#set_dont_use [get_lib_cells CTC06ST_typ_3_3V_25C/SDFRRQST_X1]
#set_dont_use [get_lib_cells CTC06ST_typ_3_3V_25C/SDFRRQST_X2]
#set_dont_use [get_lib_cells CTC06ST_typ_3_3V_25C/SDFRRQST_X4]
#set_dont_use [get_lib_cells CTC06ST_typ_3_3V_25C/SDFRSQST_X1]
#set_dont_use [get_lib_cells CTC06ST_typ_3_3V_25C/SDFRSQST_X2]
#set_dont_use [get_lib_cells CTC06ST_typ_3_3V_25C/SDFRSQST_X4]
#set_dont_use [get_lib_cells SPRAM256X8/SPRAM256X8]
set_clock_uncertainty -setup 1.5 [get_clocks clk]
set_clock_uncertainty -setup 1.5 [get_clocks tclk]

set_clock_uncertainty -hold 0.1 [get_clocks clk]
set_clock_uncertainty -hold 0.1 [get_clocks tclk]

set_clock_latency  1.0 [get_clocks clk]
set_clock_latency  1.0 [get_clocks tclk]
